Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotPasteCircularLinks Property
 The pasted selection includes a linked instance of this file '[Name]'. A file cannot link itself, so the link was not pasted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteCircularLinks { get; }
Public Shared ReadOnly Property CannotPasteCircularLinks As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteCircularLinks {
	FailureDefinitionId^ get ();
}
static member CannotPasteCircularLinks : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace